In [11]:
import pandas as pd
# csv 읽기
df = pd.read_csv('./data/cars2.csv', encoding='cp949')
df.head(10)
# 괄호 안에 숫자를 통해 얼마나 가져올지 지정할 수 있음!

     연도    사고   사망    부상
0  2000  3910  569  2845
1  2001  3638  456  2331
2  2002  3957  421  2115
3  2003  3585  348  1843
4  2004  3242  300  1555
5  2005  2880  249  1170
6  2006  2583  284  1131
7  2007  2550  283  1114
8  2008  2449  265   955
9  2009  2374  248  1031

In [5]:
df.describe()

             year     accident        dead         hert
count    23.00000    23.000000   23.000000    23.000000
mean   2011.00000  2585.217391  282.000000  1316.913043
std       6.78233   665.280662   98.262635   546.309762
min    2000.00000  1672.000000  156.000000   733.000000
25%    2005.50000  2170.000000  225.000000   933.000000
50%    2011.00000  2449.000000  264.000000  1131.000000
75%    2016.50000  2760.000000  321.500000  1587.000000
max    2022.00000  3957.000000  569.000000  2845.000000

In [12]:
mean_df = df.mean()
mean_df

연도    2011.000000
사고    2585.217391
사망     282.000000
부상    1316.913043
dtype: float64

In [15]:
df[['사고','사망','부상']].describe()

                사고          사망           부상
count    23.000000   23.000000    23.000000
mean   2585.217391  282.000000  1316.913043
std     665.280662   98.262635   546.309762
min    1672.000000  156.000000   733.000000
25%    2170.000000  225.000000   933.000000
50%    2449.000000  264.000000  1131.000000
75%    2760.000000  321.500000  1587.000000
max    3957.000000  569.000000  2845.000000

In [21]:
df[['사고','사망','부상']].sum().apply(lambda x : '{:,}'.format(x))
# 익명함수를 활용하여, 3자리 마다 쉼표 넣기

사고    59,460
사망     6,486
부상    30,289
dtype: object

In [22]:
df[['사고','사망','부상']].mean().apply(lambda x : '{:,}'.format(x))

사고     2,585.217391304348
사망                  282.0
부상    1,316.9130434782608
dtype: object